from turtledemo.sorting_animate import start_ssort

data = {
    "КАНЦЕЛЯРСКИЕ ТОВАРЫ": [
        {
            "serial": 1,
            "name": "Архивный короб (с крышкой) (под формат А4)",
            "description": "(внутренний размер ДхШхВ, 325 х 235 х 235 мм)"
        },
        {
            "serial": 2,
            "name": "Папка архивная с завязками A4",
            "description": "(внутренний размер ДхШхВ, 244 х 75 х 322 мм)"
        },
        {
            "serial": 3,
            "name": "Батарейка ААА, 1,5 v",
            "description": ""
        },
        {
            "serial": 4,
            "name": "Батарейка АА, 1,5 v",
            "description": ""
        },
        {
            "serial": 5,
            "name": "Батарейка D, 1,5 v",
            "description": ""
        },
        {
            "serial": 6,
            "name": "Батарейка Крона, 9 v",
            "description": ""
        },
        {
            "serial": 7,
            "name": "Батарейка CR2032,3 v",
            "description": ""
        },
        {
            "serial": 8,
            "name": "Бумага для заметок с клейким краем (стикеры)",
            "description": "(размер 76х51 мм (100 л.))"
        },
        {
            "serial": 9,
            "name": "Бумага для заметок с клейким краем (стикеры)",
            "description": "(размер 38х51 мм (4 блока по 50 л.))"
        },
        {
            "serial": 10,
            "name": "Блок для записей",
            "description": "(размер 90х90х50 мм, цвет белый)"
        },
        {
            "serial": 11,
            "name": "Бумага для факса (ролик)",
            "description": ""
        },
        {
            "serial": 12,
            "name": "Закладки клейкие (8 цв. по 25 л.)",
            "description": "(45 мм х 12 мм)"
        },
        {
            "serial": 13,
            "name": "Этикетка самоклеящаяся",
            "description": "(размер 105х148 мм, в пачке 100 л.), 4 шт. на листе А4"
        },
        {
            "serial": 14,
            "name": "Этикетка самоклеящаяся",
            "description": "(размер 210х148мм, в пачке 100 л.), 2 шт. на листе А4"
        },
        {
            "serial": 15,
            "name": "Этикетка самоклеящаяся",
            "description": "(размер 70х37мм, в пачке 100 л.), 24 шт. на листе А4"
        },
        {
            "serial": 16,
            "name": "Нить прошивочная для документов лавсановая",
            "description": "(Цвет белый, диаметр сечения - 0,7 мм, длина - 1000 м)"
        },
        {
            "serial": 17,
            "name": "Игла для сшивания документов",
            "description": "(100/125 мм, (в 1 упаковке - 3 шт.)"
        },
        {
            "serial": 18,
            "name": "Календарь настенный 3-х блочный на 2025 год",
            "description": "(330x790 MM)"
        },
        {
            "serial": 19,
            "name": "Карандаш чернографитовый",
            "description": ""
        },
        {
            "serial": 20,
            "name": "Точилка для карандашей",
            "description": ""
        },
        {
            "serial": 21,
            "name": "Карандаш механический",
            "description": "(диаметр грифеля - 0,5 мм)"
        },
        {
            "serial": 22,
            "name": "Стержни карандашу механическому",
            "description": "(диаметр грифеля - 0,5 мм, количество штук в упаковке - 12 шт.)"
        },
        {
            "serial": 23,
            "name": "Клей ПВА",
            "description": "(объем/вес - не менее 125 г.)"
        },
        {
            "serial": 24,
            "name": "Клеящий карандаш",
            "description": "(объем/вес - не менее 40 г.)"
        },
        {
            "serial": 25,
            "name": "Конверты для хранения CD дисков",
            "description": "(125 мм х 125 мм, упаковка 25 шт.)"
        },
        {
            "serial": 26,
            "name": "Корзина для бумаг",
            "description": "(объем - 10 л)"
        },
        {
            "serial": 27,
            "name": "Корректирующая жидкость",
            "description": "(объем не менее 20 мл, вид апликатора - кисточка)"
        },
        {
            "serial": 28,
            "name": "Корректирующая лента",
            "description": "(ширина ленты 5 мм, длина ленты - не менее 10 м)"
        },
        {
            "serial": 29,
            "name": "Ластик",
            "description": ""
        },
        {
            "serial": 30,
            "name": "Линейка пластиковая",
            "description": "(длина шкалы - 30 см.)"
        },
        {
            "serial": 31,
            "name": "Лоток для бумаг, вертикальный одиночный",
            "description": "(материал - пластик)"
        },
        {
            "serial": 32,
            "name": "Лоток для бумаг, горизонтальный",
            "description": "(материал - пластик)"
        },
        {
            "serial": 33,
            "name": "Маркер для CD (цвет-синий)",
            "description": "(перманентный, толщина линии 0,5 мм)"
        },
        {
            "serial": 34,
            "name": "Маркер перманентный",
            "description": "(перманентный, толщина линии 1,5-3 мм)"
        },
        {
            "serial": 35,
            "name": "Набор текстовыделителей (4 цвета)",
            "description": "(толщина линии 1-4 мм)"
        },
        {
            "serial": 36,
            "name": "Нож канцелярский",
            "description": "(ширина лезвия - 9 мм)"
        },
        {
            "serial": 37,
            "name": "Нож канцелярский",
            "description": "(ширина лезвия - 18 мм)"
        },
        {
            "serial": 38,
            "name": "Ножницы канцелярские",
            "description": "(длина лезвия - не менее 200 мм)"
        },
        {
            "serial": 39,
            "name": "Папка для документов на завязках",
            "description": "(формат - 44)"
        },
        {
            "serial": 40,
            "name": "Папка-регистратор",
            "description": "(ширина корешка - 50 мм)"
        },
        {
            "serial": 41,
            "name": "Папка-регистратор",
            "description": "(ширина корешка - 80 мм)"
        },
        {
            "serial": 42,
            "name": "Папка-скоросшиватель картонная",
            "description": "(формат А4)"
        },
        {
            "serial": 43,
            "name": "Папка-уголок",
            "description": "(формат 44)"
        },
        {
            "serial": 44,
            "name": "Резинка универсальная (банковская)",
            "description": ""
        },
        {
            "serial": 45,
            "name": "Ручка шариковая синяя",
            "description": ""
        },
        {
            "serial": 46,
            "name": "Ручка шариковая черная",
            "description": ""
        },
        {
            "serial": 47,
            "name": "Клейкая лента (скотч)",
            "description": "(ширина 48 мм, длина 60 мм)"
        },
        {
            "serial": 48,
            "name": "Сменная подушка для гербовой печати (R45)",
            "description": "(диаметр подушки - 45 мм)"
        },
        {
            "serial": 49,
            "name": "Сменная подушка для гербовой печати (R40)",
            "description": "(диаметр подушки - 45 мм)"
        },
        {
            "serial": 50,
            "name": "Файл - вкладыш",
            "description": "(в 1 упаковке - 100 шт)"
        },
        {
            "serial": 51,
            "name": "Шпагат в бобине",
            "description": "(материал-полипропилен, длина 500 м, цвет - белый)"
        },
        {
            "serial": 52,
            "name": "Штемпельная краска",
            "description": "(объем/вес - 50 г, цвет - синий)"
        },
        {
            "serial": 53,
            "name": "Штемпельная подушка",
            "description": "(размер рабочей поверхности – 70 мм х 110 мм)"
        },
        {
            "serial": 54,
            "name": "Антистеплер",
            "description": ""
        },
        {
            "serial": 55,
            "name": "Дырокол",
            "description": "(количество пробиваемых листов ≤ 25)"
        },
        {
            "serial": 56,
            "name": "Дырокол",
            "description": "(количество пробиваемых листов ≤ 100)"
        },
        {
            "serial": 57,
            "name": "Зажим для бумаг, ширина 25 мм",
            "description": "до 100 листов (в 1 упаковке - 12 шт.)"
        },
        {
            "serial": 58,
            "name": "Зажим для бумаг, ширина 32 мм",
            "description": "до 140 листов (в 1 упаковке - 12 шт.)"
        },
        {
            "serial": 59,
            "name": "Зажим для бумаг, ширина 51 мм",
            "description": "до 230 листов (в 1 упаковке - 12 шт.)"
        },
        {
            "serial": 60,
            "name": "Курьер-пакет почтовый",
            "description": "(размер 320х355 мм)"
        },
        {
            "serial": 61,
            "name": "Скобы для степлера № 10",
            "description": "сшивающая способность от 2 до 20 листов,(кол-во в 1 упаковке – 1000 шт.)"
        },
        {
            "serial": 62,
            "name": "Скобы для степлера 23/8",
            "description": "сшивающая способность от 30 до 50 листов,(кол-во в 1 упаковке – 1000 шт.)"
        },
        {
            "serial": 63,
            "name": "Скобы для степлера 23/10",
            "description": "сшивающая способность от 50 до 70 листов, (кол-во в 1 упаковке – 1000 шт.)"
        },
        {
            "serial": 64,
            "name": "Скобы для степлера 23/13",
            "description": "сшивающая способность от 70 до 100 листов, (кол-во в 1 упаковке – 1000 шт.)"
        },
        {
            "serial": 65,
            "name": "Скобы для степлера 23/23",
            "description": "сшивающая способность от 180 до 240 листов, (кол-во в 1 упаковке – 1000 шт.)"
        },
        {
            "serial": 66,
            "name": "Скобы для степлера 24/6",
            "description": "сшивающая способность от 2 до 30 листов, (кол-во в 1 упаковке – 1000 шт.)"
        },
        {
            "serial": 67,
            "name": "Скрепки 50 мм",
            "description": "(в 1 упаковке – 50 шт.)"
        },
        {
            "serial": 68,
            "name": "Скрепки 28 мм",
            "description": "(в 1 упаковке – 100 шт.)"
        },
        {
            "serial": 69,
            "name": "Степлер № 10",
            "description": "(кол-во пробиваемых листов – 10)"
        },
        {
            "serial": 70,
            "name": "Степлер № 24/6",
            "description": "(кол-во пробиваемых листов – 20)"
        },
        {
            "serial": 71,
            "name": "Степлер мощный",
            "description": "(кол-во пробиваемых листов – 100)"
        },
        {
            "serial": 72,
            "name": "Шило канцелярское (с ушком)",
            "description": ""
        },
        {
            "serial": 73,
            "name": "Датер автоматический",
            "description": ""
        },
        {
            "serial": 74,
            "name": "Сменная подушка для датера автоматического",
            "description": ""
        },
        {
            "serial": 75,
            "name": 'ШТАМП "ДУБЛИКАТ"',
            "description": ""
        },
        {
            "serial": 76,
            "name": "Подушки для смачивания пальцев (гелевая)",
            "description": ""
        },
        {
            "serial": 77,
            "name": "Калькулятор настольный (12 разрядный)",
            "description": ""
        },
        {
            "serial": 78,
            "name": "Подставка-органайзер для канцелярских принадлежностей",
            "description": ""
        },
        {
            "serial": 79,
            "name": "Уничтожитель бумаги (шредер)",
            "description": ""
        },
        {
            "serial": 80,
            "name": "Ежедневник (блокнот)",
            "description": ""
        },
        {
            "serial": 81,
            "name": "Дырокол",
            "description": "(на 4 отверстия, количество пробиваемых листов ≤ 150)"
        },
        {
            "serial": 82,
            "name": "Сменные ножи для дырокола",
            "description": "(количество пробиваемых листов ≤ 150)"
        },
        {
            "serial": 83,
            "name": "Папка-обложка картонная (Форма No 18)",
            "description": ""
        },
        {
            "serial": 84,
            "name": "Бумага для офисной техники (формат А4)",
            "description": ""
        },
        {
            "serial": 85,
            "name": "Конверт почтовые бумажные С4",
            "description": ""
        },
        {
            "serial": 86,
            "name": "Конверт почтовые бумажные С5",
            "description": ""
        },
        {
            "serial": 87,
            "name": "Весы для взвешивания почтовой корреспонденции",
            "description": ""
        },
        {
            "serial": 88,
            "name": "Исполнительные листы",
            "description": ""
        },
],
"ВЫЧИСЛИТЕЛЬНАЯ И ПЕЧАТАЮЩАЯ ТЕХНИКА": [
        {
            "serial": 89,
            "name": "Многофункциональной устройство (МФУ)",
            "description": "(формат А4)"
        },
        {
            "serial": 90,
            "name": "Копировальный аппарат (формат А3)",
            "description": ""
        },
        {
            "serial": 91,
            "name": "Принтер (формат А4)",
            "description": ""
        },
        {
            "serial": 92,
            "name": "Монитор",
            "description": ""
        },
        {
            "serial": 93,
            "name": "Системный блок",
            "description": ""
        },
        {
            "serial": 94,
            "name": "Клавиатура",
            "description": ""
        },
        {
            "serial": 95,
            "name": "Компьютерная мышь",
            "description": ""
        },
        {
            "serial": 96,
            "name": "Источник бесперебойного питания 97 Колонки компьютерные (комплект)",
            "description": ""
        },
        {
            "serial": 97,
            "name": "Колонки компьютерные (комплект)",
            "description": ""
        },
        {
            "serial": 98,
            "name": "Сетевой фильтр (удлинитель)",
            "description": ""
        },
        {
            "serial": 99,
            "name": "Ноутбук",
            "description": ""
        },
        {
            "serial": 100,
            "name": "Программа для распознавания текста",
            "description": ""
        },
        {
            "serial": 101,
            "name": "Соединительные кабеля (провода)",
            "description": ""
        },
        {
            "serial": 102,
            "name": "Картридж",
            "description": "(необходимо уточнение марки принтера)"
        },
        {
            "serial": 103,
            "name": "Фотобарабан (Драм-юнит)",
            "description": ""
        },
        {
            "serial": 104,
            "name": "Сумка для ноутбука",
            "description": ""
        },
        {
            "serial": 105,
            "name": "CD диски",
            "description": ""
        },
        {
            "serial": 106,
            "name": "Термопленка для факса",
            "description": ""
        },
        {
            "serial": 107,
            "name": "привод DVD-RW",
            "description": ""
        }
],
"ПЕЧАТИ, ШТАМПЫ": [
        {
            "serial": 108,
            "name": "Печать мирового судьи",
            "description": "(c воспроизведением Государственного герба Российской Федерации)"
        },
        {
            "serial": 109,
            "name": "Штемпель № 2",
            "description": "Угловой штамп с изображением герба Санкт-Петербурга, наименования мирового судьи Санкт-Петербурга, номера судебного участка, почтового адреса и  телефона (факса), с полем для записи даты и регистрационного номера исходящей корреспонденции"
        },
        {
            "serial": 110,
            "name": "Штемпель № 3",
            "description": "Штамп для регистрации поступающей корреспонденции, с полем для записи даты и регистрационного номера входящей корреспонденции"
        },
        {
            "serial": 111,
            "name": "Штемпель № 4",
            "description": "Штамп с полным наименованием и почтовым адресом судебного участка мирового судьи Санкт-Петербурга"
        },
        {
            "serial": 112,
            "name": "Штемпель № 5",
            "description": "Штамп «Мировой судья судебного участка № __ Санкт-Петербурга"
        },
        {
            "serial": 113,
            "name": "Штемпель № 6",
            "description": "Штамп «Копия верна», с наличием строк для подписей мирового судьи и секретаря"
        },
        {
            "serial": 114,
            "name": "Штемпель № 7",
            "description": "Штамп «Копия верна», с наличием строки для подписи мирового судьи"
        },
{
            "serial": 115,
            "name": "Штемпель № 8",
            "description": "Штамп «Копия», без строки для подписи"
        },
        {
            "serial": 116,
            "name": "Штемпель № 9",
            "description": "Штамп «Судебная повестка»"
        },
        {
            "serial": 117,
            "name": "Штемпель № 10",
            "description": "Штамп «Судебное»"
        },
        {
            "serial": 118,
            "name": "Штемпель № 11",
            "description": "Штамп для отметок на судебных извещениях о вызове к мировому судье, о времени прибытия и убытия участников судопроизводства, с наличием строки для подписи секретаря"
        },
        {
            "serial": 119,
            "name": "Штемпель № 12",
            "description": "Штамп «Приговор вступил в законную силу», с наличием строки для даты, подписей мирового судьи и секретаря"
        },
        {
            "serial": 120,
            "name": "Штемпель № 13",
            "description": "Штамп «Решение вступило в законную силу», с наличием строки для даты, подписей мирового судьи и секретаря"
        },
        {
            "serial": 121,
            "name": "Штемпель № 14",
            "description": "Штамп «Постановление вступило в законную силу», с наличием строк для даты, подписей мирового судьи и секретаря"
        },
        {
            "serial": 122,
            "name": "Штемпель № 15",
            "description": "Штамп «Определение вступило в законную силу», с наличием строк для даты, подписей мирового судьи и секретаря"
        },
        {
            "serial": 123,
            "name": "Штемпель № 16",
            "description": "Штамп «Судебный приказ вступил в законную силу», с наличием строк для даты, подписей мирового судьи и секретаря"
        },
        {
            "serial": 124,
            "name": "Штемпель № 17",
            "description": "Штамп для отметки об оплате суммы штрафа, с наличием строк для указания суммы штрафа, подписи мирового судьи и даты"
        },
        {
            "serial": 125,
            "name": "Штемпель № 18",
            "description": "Штамп «Апелляционная жалоба поступила в канцелярию», с наличием строки для даты"
        },
        {
            "serial": 126,
            "name": "Штемпель № 19",
            "description": "Штамп «Частная жалоба поступила в канцелярию», с наличием строки для даты"
        },
        {
            "serial": 127,
            "name": "Штемпель № 20",
            "description": "Штамп «Всего в деле прошито, пронумеровано __ листов», с наличием строки для подписи секретаря"
        },
        {
            "serial": 128,
            "name": "Штемпель № 21",
            "description": "Штамп «Прошито и пронумеровано на на __ листах», с наличием строк для подписей мирового судьи и секретаря"
        },
        {
            "serial": 129,
            "name": "Штемпель № 22",
            "description": "Штамп «Архив»"
        },
        {
            "serial": 130,
            "name": "Штемпель № 23",
            "description": "Штамп «Исполнено, сдать в архив», с наличием строки для подписи мирового судьи"
        },
        {
            "serial": 131,
            "name": "Штемпель № 24",
            "description": "Штамп «Мера пресечения заключение под стражу»"
        },
        {
            "serial": 132,
            "name": "Штемпель № 25",
            "description": "Штамп «Сведения об оплате штрафа отсутствуют», с наличием строк для подписи секретаря и даты"
        }
],
"БЫТОВАЯ ТЕХНИКА": [
        {
            "serial": 133,
            "name": "Холодильник",
            "description": ""
        },
        {
            "serial": 134,
            "name": "Микроволновая печь",
            "description": ""
        },
{
            "serial": 135,
            "name": "Чайник",
            "description": ""
        },
        {
            "serial": 136,
            "name": "Часы настенные",
            "description": ""
        },
        {
            "serial": 137,
            "name": "Телевизор",
            "description": ""
        },
        {
            "serial": 138,
            "name": "Водонагреватель накопительный",
            "description": ""
        },
        {
            "serial": 139,
            "name": "Кварцеватель помещения",
            "description": ""
        },
{
            "serial": 140,
            "name": "Кондиционер (сплит-система)",
            "description": ""
        },
        {
            "serial": 141,
            "name": "Кондиционер (мобильный)",
            "description": ""
        },
        {
            "serial": 142,
            "name": "Завеса тепловая",
            "description": "(для установки при входе на судебный участок)"
        },
        {
            "serial": 143,
            "name": "Вентилятор",
            "description": ""
        },
        {
            "serial": 144,
            "name": "Настольная лампа",
            "description": ""
        }
],
"ФЛАГИ, ГЕРБЫ, МАНТИИ": [
        {
            "serial": 145,
            "name": "Государственный флаг Российской Федерации ",
            "description": "в зал судебного заседания, (размер 1 х 1,5 метра)"
        },
        {
            "serial": 146,
            "name": "Флаг Санкт-Петербурга",
            "description": "в зал судебного заседания, (размер 1 х 1,5 метра)"
        },
        {
            "serial": 147,
            "name": "Государственный флаг Российской Федерации",
            "description": "для размещения на открытом воздухе (размер 1 х 1,5 метра)"
        },
        {
            "serial": 148,
            "name": "Флаг Санкт-Петербурга",
            "description": "для размещения на открытом воздухе"
        },
        {
            "serial": 149,
            "name": "Государственный герб Российской Федерации",
            "description": ""
        },
        {
            "serial": 150,
            "name": "Герб Санкт-Петербурга",
            "description": ""
        },
        {
            "serial": 151,
            "name": "Древко",
            "description": "для крепления флага"
        },
        {
            "serial": 152,
            "name": "Навершие",
            "description": "наконечник для древка"
        },
        {
            "serial": 153,
            "name": "Напольный флагшток",
            "description": ""
        },
        {
            "serial": 154,
            "name": "Кронштейн для крепления флагов на фасад здания",
            "description": ""
        },
        {
            "serial": 155,
            "name": "Мантия судьи",
            "description": "(комплект)"
        },
    ]
}

from web_app.src.models import Category, Item
from web_app.src.core import connection
import asyncio

@connection
async def write_data_in_db(session):
    for key, items in data.items():
        new_category = Category(name=key)
        session.add(new_category)
        await session.flush()
        await session.refresh(new_category)

        for item in items:
            new_item = Item(
                serial_number=str(item["serial"]),
                name=item["name"],
                description=item["description"],
                category_id=new_category.id
            )
            session.add(new_item)

    await session.commit()


if __name__ == "__main__":
    asyncio.run(write_data_in_db())